# Используем базовый образ Python
FROM python:3.11

#чтобы сервер джанго поднимался, не замирал перед запуском. Иногда без этой настройки контейнер может не подняться.
ENV PYTHONUNBUFFERED 1

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем зависимости в контейнер
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем код приложения в контейнер
COPY . .

# Команда для запуска приложения при старте контейнера
#CMD ["python", "app.py"]
#CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]